app/views/albums/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
        </td>
          reviewed on: <%= review.created_at.to_s %> by <%= review.user.first_name %> <%= review.user.last_name %>