app/controllers/albums_controller.rb

SELECT "albums".* FROM "albums"
---
  def index
    @albums = Album.all

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
  def show
    @album = Album.find(params[:id])
    @user = User.find(@album.user.id)

INSERT INTO "albums" ("title", "artist", "release_year", "summary", "genre", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Lonerism"], ["artist", "Tame"], ["release_year", "2012"], ["summary", "WADImwad"], ["genre", ""], ["user_id", 1]]
---
  def create
  @album = Album.new(album_params)
  @album.user = current_user

  respond_to do |format|
    if @album.save

UPDATE "albums" SET "title" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["title", "="], ["updated_at", "2018-02-28 14:52:15.157465"], ["id", 1]]
---
def update
  if @album.update(album_params)

DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 1]]
SELECT "albums".* FROM "albums" ORDER BY created_at DESC
---
 def destroy
   @album.destroy
   @albums = Album.all

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_album
    @album = Album.find(params[:id])